app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "I have something to say, do you have time to listen."], ["created_at", Fri, 05 Feb 2016 09:09:47 UTC +00:00], ["title", "MY LIFE"], ["updated_at", Fri, 05 Feb 2016 09:09:47 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save